witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_AUDIO_HPF_CW_HOTKEY(void)
{
	sysmenu_handlers_selected = &sysmenu_audio_handlers[0];
	sysmenu_item_count_selected = &sysmenu_audio_item_count;
	systemMenuIndex = 8;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_SQUELCH_HOTKEY(void)
{
	sysmenu_handlers_selected = &sysmenu_audio_handlers[0];
	sysmenu_item_count_selected = &sysmenu_audio_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 12;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_AGC_HOTKEY(void)
{
	sysmenu_handlers_selected = &sysmenu_audio_handlers[0];
	sysmenu_item_count_selected = &sysmenu_audio_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 20;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_AUDIO_IFGain(int8_t direction)
{
	TRX.IF_Gain += direction;
	if (TRX.IF_Gain < 1)
		TRX.IF_Gain = 1;
	if (TRX.IF_Gain > 80)
		TRX.IF_Gain = 80;
}

static void SYSMENU_HANDL_AUDIO_AGC_GAIN_TARGET(int8_t direction)
{
	TRX.AGC_GAIN_TARGET += direction;
	if (TRX.AGC_GAIN_TARGET < -80)
		TRX.AGC_GAIN_TARGET = -80;
	if (TRX.AGC_GAIN_TARGET > -10)
		TRX.AGC_GAIN_TARGET = -10;
}

static void SYSMENU_HANDL_AUDIO_MIC_Gain(int8_t direction)
{
	TRX.MIC_GAIN += direction;
	if (TRX.MIC_GAIN < 1)
		TRX.MIC_GAIN = 1;
	if (TRX.MIC_GAIN > 20)
		TRX.MIC_GAIN = 20;
}

static void SYSMENU_HANDL_AUDIO_DNR_THRES(int8_t direction)
{
	TRX.DNR_SNR_THRESHOLD += direction;
	if (TRX.DNR_SNR_THRESHOLD < 1)
		TRX.DNR_SNR_THRESHOLD = 1;
	if (TRX.DNR_SNR_THRESHOLD > 100)
		TRX.DNR_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_AVERAGE(int8_t direction)
{
	TRX.DNR_AVERAGE += direction;
	if (TRX.DNR_AVERAGE < 1)
		TRX.DNR_AVERAGE = 1;
	if (TRX.DNR_AVERAGE > 100)
		TRX.DNR_AVERAGE = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_MINMAL(int8_t direction)
{
	TRX.DNR_MINIMAL += direction;
	if (TRX.DNR_MINIMAL < 1)
		TRX.DNR_MINIMAL = 1;
	if (TRX.DNR_MINIMAL > 100)
		TRX.DNR_MINIMAL = 100;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW(int8_t direction)
{
	TRX.MIC_EQ_LOW += direction;
	if (TRX.MIC_EQ_LOW < -10)
		TRX.MIC_EQ_LOW = -10;
	if (TRX.MIC_EQ_LOW > 10)
		TRX.MIC_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID(int8_t direction)
{
	TRX.MIC_EQ_MID += direction;
	if (TRX.MIC_EQ_MID < -10)
		TRX.MIC_EQ_MID = -10;
	if (TRX.MIC_EQ_MID > 10)
		TRX.MIC_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG(int8_t direction)
{
	TRX.MIC_EQ_HIG += direction;
	if (TRX.MIC_EQ_HIG < -10)
		TRX.MIC_EQ_HIG = -10;
	if (TRX.MIC_EQ_HIG > 10)
		TRX.MIC_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_REVERBER(int8_t direction)
{
	if (direction > 0 || TRX.MIC_REVERBER > 0)
		TRX.MIC_REVERBER += direction;
	if (TRX.MIC_REVERBER > (AUDIO_MAX_REVERBER_TAPS - 1))
		TRX.MIC_REVERBER = (AUDIO_MAX_REVERBER_TAPS - 1);
	NeedReinitReverber = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_LOW(int8_t direction)
{
	TRX.RX_EQ_LOW += direction;
	if (TRX.RX_EQ_LOW < -10)
		TRX.RX_EQ_LOW = -10;
	if (TRX.RX_EQ_LOW > 10)
		TRX.RX_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_MID(int8_t direction)
{
	TRX.RX_EQ_MID += direction;
	if (TRX.RX_EQ_MID < -10)
		TRX.RX_EQ_MID = -10;
	if (TRX.RX_EQ_MID > 10)
		TRX.RX_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_HIG(int8_t direction)
{
	TRX.RX_EQ_HIG += direction;
	if (TRX.RX_EQ_HIG < -10)
		TRX.RX_EQ_HIG = -10;
	if (TRX.RX_EQ_HIG > 10)
		TRX.RX_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_SSB_Speed(int8_t direction)
{
	TRX.RX_AGC_SSB_speed += direction;
	if (TRX.RX_AGC_SSB_speed < 1)
		TRX.RX_AGC_SSB_speed = 1;
	if (TRX.RX_AGC_SSB_speed > 20)
		TRX.RX_AGC_SSB_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_CW_Speed(int8_t direction)
{
	TRX.RX_AGC_CW_speed += direction;
	if (TRX.RX_AGC_CW_speed < 1)
		TRX.RX_AGC_CW_speed = 1;
	if (TRX.RX_AGC_CW_speed > 20)
		TRX.RX_AGC_CW_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_TX_AGCSpeed(int8_t direction)
{
	TRX.TX_AGC_speed += direction;
	if (TRX.TX_AGC_speed < 1)
		TRX.TX_AGC_speed = 1;
	if (TRX.TX_AGC_speed > 10)
		TRX.TX_AGC_speed = 10;
}

static void SYSMENU_HANDL_AUDIO_FMSquelch(int8_t direction)
{
	if (direction < 0 && CurrentVFO()->FM_SQL_threshold == 0)
		return;
	CurrentVFO()->FM_SQL_threshold += direction;
	if (CurrentVFO()->FM_SQL_threshold > 10)
		CurrentVFO()->FM_SQL_threshold = 10;
	TRX.FM_SQL_threshold = CurrentVFO()->FM_SQL_threshold;
	
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold = CurrentVFO()->FM_SQL_threshold;
}

static void SYSMENU_HANDL_AUDIO_VAD_Squelch(int8_t direction)
{
	if (direction > 0)
		TRX.VAD_Squelch = true;
	if (direction < 0)
		TRX.VAD_Squelch = false;
}

static void SYSMENU_HANDL_AUDIO_SSB_HPF_pass(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.SSB_HPF_Filter == 0)
			TRX.SSB_HPF_Filter = 60;
		else if (TRX.SSB_HPF_Filter == 60)
			TRX.SSB_HPF_Filter = 100;
		else if (TRX.SSB_HPF_Filter == 100)
			TRX.SSB_HPF_Filter = 200;
		else if (TRX.SSB_HPF_Filter == 200)
			TRX.SSB_HPF_Filter = 300;
		else if (TRX.SSB_HPF_Filter == 300)
			TRX.SSB_HPF_Filter = 400;
		else if (TRX.SSB_HPF_Filter == 400)
			TRX.SSB_HPF_Filter = 500;
	}
	else
	{
		if (TRX.SSB_HPF_Filter == 60)
			TRX.SSB_HPF_Filter = 0;
		else if (TRX.SSB_HPF_Filter == 100)
			TRX.SSB_HPF_Filter = 60;
		else if (TRX.SSB_HPF_Filter == 200)
			TRX.SSB_HPF_Filter = 100;
		else if (TRX.SSB_HPF_Filter == 300)
			TRX.SSB_HPF_Filter = 200;
		else if (TRX.SSB_HPF_Filter == 400)
			TRX.SSB_HPF_Filter = 300;
		else if (TRX.SSB_HPF_Filter == 500)
			TRX.SSB_HPF_Filter = 400;
	}
	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_CW_HPF_pass(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.CW_HPF_Filter == 0)
			TRX.CW_HPF_Filter = 60;
		else if (TRX.CW_HPF_Filter == 60)
			TRX.CW_HPF_Filter = 100;
	}
	else
	{
		if (TRX.CW_HPF_Filter == 60)
			TRX.CW_HPF_Filter = 0;
		else if (TRX.CW_HPF_Filter == 100)
			TRX.CW_HPF_Filter = 60;
	}
	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_CW_LPF_pass(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.CW_LPF_Filter == 100)
			TRX.CW_LPF_Filter = 150;
		else if (TRX.CW_LPF_Filter == 150)
			TRX.CW_LPF_Filter = 200;
		else if (TRX.CW_LPF_Filter == 200)
			TRX.CW_LPF_Filter = 250;
		else if (TRX.CW_LPF_Filter == 250)
			TRX.CW_LPF_Filter = 300;
		else if (TRX.CW_LPF_Filter == 300)
			TRX.CW_LPF_Filter = 350;
		else if (TRX.CW_LPF_Filter == 350)
			TRX.CW_LPF_Filter = 400;
		else if (TRX.CW_LPF_Filter == 400)
			TRX.CW_LPF_Filter = 450;
		else if (TRX.CW_LPF_Filter == 450)
			TRX.CW_LPF_Filter = 500;
		else if (TRX.CW_LPF_Filter == 500)
			TRX.CW_LPF_Filter = 550;
		else if (TRX.CW_LPF_Filter == 550)
			TRX.CW_LPF_Filter = 600;
		else if (TRX.CW_LPF_Filter == 600)
			TRX.CW_LPF_Filter = 650;
		else if (TRX.CW_LPF_Filter == 650)
			TRX.CW_LPF_Filter = 700;
		else if (TRX.CW_LPF_Filter == 700)
			TRX.CW_LPF_Filter = 750;
		else if (TRX.CW_LPF_Filter == 750)
			TRX.CW_LPF_Filter = 800;
		else if (TRX.CW_LPF_Filter == 800)
			TRX.CW_LPF_Filter = 850;
		else if (TRX.CW_LPF_Filter == 850)
			TRX.CW_LPF_Filter = 900;
		else if (TRX.CW_LPF_Filter == 900)
			TRX.CW_LPF_Filter = 950;
		else if (TRX.CW_LPF_Filter == 950)
			TRX.CW_LPF_Filter = 1000;
	}
	else
	{
		if (TRX.CW_LPF_Filter == 1000)
			TRX.CW_LPF_Filter = 950;
		else if (TRX.CW_LPF_Filter == 950)
			TRX.CW_LPF_Filter = 900;
		else if (TRX.CW_LPF_Filter == 900)
			TRX.CW_LPF_Filter = 850;
		else if (TRX.CW_LPF_Filter == 850)
			TRX.CW_LPF_Filter = 800;
		else if (TRX.CW_LPF_Filter == 800)
			TRX.CW_LPF_Filter = 750;
		else if (TRX.CW_LPF_Filter == 750)
			TRX.CW_LPF_Filter = 700;
		else if (TRX.CW_LPF_Filter == 700)
			TRX.CW_LPF_Filter = 650;
		else if (TRX.CW_LPF_Filter == 650)
			TRX.CW_LPF_Filter = 600;
		else if (TRX.CW_LPF_Filter == 600)
			TRX.CW_LPF_Filter = 550;
		else if (TRX.CW_LPF_Filter == 550)
			TRX.CW_LPF_Filter = 500;
		else if (TRX.CW_LPF_Filter == 500)
			TRX.CW_LPF_Filter = 450;
		else if (TRX.CW_LPF_Filter == 450)
			TRX.CW_LPF_Filter = 400;
		else if (TRX.CW_LPF_Filter == 400)
			TRX.CW_LPF_Filter = 350;
		else if (TRX.CW_LPF_Filter == 350)
			TRX.CW_LPF_Filter = 300;
		else if (TRX.CW_LPF_Filter == 300)
			TRX.CW_LPF_Filter = 250;
		else if (TRX.CW_LPF_Filter == 250)
			TRX.CW_LPF_Filter = 200;
		else if (TRX.CW_LPF_Filter == 200)
			TRX.CW_LPF_Filter = 150;
		else if (TRX.CW_LPF_Filter == 150)
			TRX.CW_LPF_Filter = 100;
	}

	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_pass(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.SSB_LPF_Filter == 0)
			TRX.SSB_LPF_Filter = 1400;

		if (TRX.SSB_LPF_Filter == 1400)
			TRX.SSB_LPF_Filter = 1600;
		else if (TRX.SSB_LPF_Filter == 1600)
			TRX.SSB_LPF_Filter = 1800;
		else if (TRX.SSB_LPF_Filter == 1800)
			TRX.SSB_LPF_Filter = 2100;
		else if (TRX.SSB_LPF_Filter == 2100)
			TRX.SSB_LPF_Filter = 2300;
		else if (TRX.SSB_LPF_Filter == 2300)
			TRX.SSB_LPF_Filter = 2500;
		else if (TRX.SSB_LPF_Filter == 2500)
			TRX.SSB_LPF_Filter = 2700;
		else if (TRX.SSB_LPF_Filter == 2700)
			TRX.SSB_LPF_Filter = 2900;
		else if (TRX.SSB_LPF_Filter == 2900)
			TRX.SSB_LPF_Filter = 3000;
		else if (TRX.SSB_LPF_Filter == 3000)
			TRX.SSB_LPF_Filter = 3200;
		else if (TRX.SSB_LPF_Filter == 3200)
			TRX.SSB_LPF_Filter = 3400;
	}
	else
	{
		if (TRX.SSB_LPF_Filter == 1600)
			TRX.SSB_LPF_Filter = 1400;
		else if (TRX.SSB_LPF_Filter == 1800)
			TRX.SSB_LPF_Filter = 1600;
		else if (TRX.SSB_LPF_Filter == 2100)
			TRX.SSB_LPF_Filter = 1800;
		else if (TRX.SSB_LPF_Filter == 2300)
			TRX.SSB_LPF_Filter = 2100;
		else if (TRX.SSB_LPF_Filter == 2500)
			TRX.SSB_LPF_Filter = 2300;
		else if (TRX.SSB_LPF_Filter == 2700)
			TRX.SSB_LPF_Filter = 2500;
		else if (TRX.SSB_LPF_Filter == 2900)
			TRX.SSB_LPF_Filter = 2700;
		else if (TRX.SSB_LPF_Filter == 3000)
			TRX.SSB_LPF_Filter = 2900;
		else if (TRX.SSB_LPF_Filter == 3200)
			TRX.SSB_LPF_Filter = 3000;
		else if (TRX.SSB_LPF_Filter == 3400)
			TRX.SSB_LPF_Filter = 3200;
	}

	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

static void SYSMENU_HANDL_AUDIO_AM_LPF_pass(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.AM_LPF_Filter == 2100)
			TRX.AM_LPF_Filter = 2300;
		else if (TRX.AM_LPF_Filter == 2300)
			TRX.AM_LPF_Filter = 2500;
		else if (TRX.AM_LPF_Filter == 2500)
			TRX.AM_LPF_Filter = 2700;
		else if (TRX.AM_LPF_Filter == 2700)
			TRX.AM_LPF_Filter = 2900;
		else if (TRX.AM_LPF_Filter == 2900)
			TRX.AM_LPF_Filter = 3000;
		else if (TRX.AM_LPF_Filter == 3000)
			TRX.AM_LPF_Filter = 3200;
		else if (TRX.AM_LPF_Filter == 3200)
			TRX.AM_LPF_Filter = 3400;
		else if (TRX.AM_LPF_Filter == 3400)
			TRX.AM_LPF_Filter = 3600;
		else if (TRX.AM_LPF_Filter == 3600)
			TRX.AM_LPF_Filter = 3800;
		else if (TRX.AM_LPF_Filter == 3800)
			TRX.AM_LPF_Filter = 4000;
		else if (TRX.AM_LPF_Filter == 4000)
			TRX.AM_LPF_Filter = 4500;
		else if (TRX.AM_LPF_Filter == 4500)
			TRX.AM_LPF_Filter = 5000;
		else if (TRX.AM_LPF_Filter == 5000)
			TRX.AM_LPF_Filter = 6000;
		else if (TRX.AM_LPF_Filter == 6000)
			TRX.AM_LPF_Filter = 7000;
		else if (TRX.AM_LPF_Filter == 7000)
			TRX.AM_LPF_Filter = 8000;
		else if (TRX.AM_LPF_Filter == 8000)
			TRX.AM_LPF_Filter = 9000;
		else if (TRX.AM_LPF_Filter == 9000)
			TRX.AM_LPF_Filter = 10000;
	}
	else
	{
		if (TRX.AM_LPF_Filter == 2300)
			TRX.AM_LPF_Filter = 2100;
		else if (TRX.AM_LPF_Filter == 2500)
			TRX.AM_LPF_Filter = 2300;
		else if (TRX.AM_LPF_Filter == 2700)
			TRX.AM_LPF_Filter = 2500;
		else if (TRX.AM_LPF_Filter == 2900)
			TRX.AM_LPF_Filter = 2700;
		else if (TRX.AM_LPF_Filter == 3000)
			TRX.AM_LPF_Filter = 2900;
		else if (TRX.AM_LPF_Filter == 3200)
			TRX.AM_LPF_Filter = 3000;
		else if (TRX.AM_LPF_Filter == 3400)
			TRX.AM_LPF_Filter = 3200;
		else if (TRX.AM_LPF_Filter == 3600)
			TRX.AM_LPF_Filter = 3400;
		else if (TRX.AM_LPF_Filter == 3800)
			TRX.AM_LPF_Filter = 3400;
		else if (TRX.AM_LPF_Filter == 4000)
			TRX.AM_LPF_Filter = 3800;
		else if (TRX.AM_LPF_Filter == 4500)
			TRX.AM_LPF_Filter = 3800;
		else if (TRX.AM_LPF_Filter == 5000)
			TRX.AM_LPF_Filter = 4500;
		else if (TRX.AM_LPF_Filter == 6000)
			TRX.AM_LPF_Filter = 5000;
		else if (TRX.AM_LPF_Filter == 7000)
			TRX.AM_LPF_Filter = 6000;
		else if (TRX.AM_LPF_Filter == 8000)
			TRX.AM_LPF_Filter = 7000;
		else if (TRX.AM_LPF_Filter == 9000)
			TRX.AM_LPF_Filter = 8000;
		else if (TRX.AM_LPF_Filter == 10000)
			TRX.AM_LPF_Filter = 9000;
	}

	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
}

