witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_WIFI_RotatePasswordChar2(int8_t dir)
{
	bool full_redraw = false;
	if (TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] == 0)
		full_redraw = true;
	TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] += dir;

	// do not show special characters
	if (TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] >= 1 && TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] <= 32 && dir > 0)
		TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] = 33;
	if (TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] >= 1 && TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] <= 32 && dir < 0)
		TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] = 0;
	if (TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] >= 127)
		TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] = 0;
	if (TRX.WIFI_PASSWORD2[sysmenu_wifi_selected_ap_password_char_index] == 0)
		full_redraw = true;

	if (full_redraw)
		LCD_UpdateQuery.SystemMenuRedraw = true;
	else
		LCD_UpdateQuery.SystemMenu = true;
}

static void SYSMENU_WIFI_RotatePasswordChar3(int8_t dir)
{
	bool full_redraw = false;
	if (TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] == 0)
		full_redraw = true;
	TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] += dir;

	// do not show special characters
	if (TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] >= 1 && TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] <= 32 && dir > 0)
		TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] = 33;
	if (TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] >= 1 && TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] <= 32 && dir < 0)
		TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] = 0;
	if (TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] >= 127)
		TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] = 0;
	if (TRX.WIFI_PASSWORD3[sysmenu_wifi_selected_ap_password_char_index] == 0)
		full_redraw = true;

	if (full_redraw)
		LCD_UpdateQuery.SystemMenuRedraw = true;
	else
		LCD_UpdateQuery.SystemMenu = true;
}

static void SYSMENU_HANDL_WIFI_Enabled(int8_t direction)
{
	if (direction > 0)
		TRX.WIFI_Enabled = true;
	if (direction < 0)
		TRX.WIFI_Enabled = false;
}

static void SYSMENU_HANDL_WIFI_SelectAP1(int8_t direction)
{
#pragma unused(direction)
	sysmenu_wifi_selectap1_menu_opened = true;
	SYSMENU_WIFI_DrawSelectAP1Menu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_SelectAP2(int8_t direction)
{
#pragma unused(direction)
	sysmenu_wifi_selectap2_menu_opened = true;
	SYSMENU_WIFI_DrawSelectAP2Menu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_SelectAP3(int8_t direction)
{
#pragma unused(direction)
	sysmenu_wifi_selectap3_menu_opened = true;
	SYSMENU_WIFI_DrawSelectAP3Menu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_SetAP1password(int8_t direction)
{
#pragma unused(direction)
	sysmenu_wifi_setAP1password_menu_opened = true;
	SYSMENU_WIFI_DrawAP1passwordMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_SetAP2password(int8_t direction)
{
#pragma unused(direction)
	sysmenu_wifi_setAP2password_menu_opened = true;
	SYSMENU_WIFI_DrawAP2passwordMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_SetAP3password(int8_t direction)
{
#pragma unused(direction)
	sysmenu_wifi_setAP3password_menu_opened = true;
	SYSMENU_WIFI_DrawAP3passwordMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WIFI_Timezone(int8_t direction)
{
	TRX.WIFI_TIMEZONE += direction;
	if (TRX.WIFI_TIMEZONE < -12)
		TRX.WIFI_TIMEZONE = -12;
	if (TRX.WIFI_TIMEZONE > 12)
		TRX.WIFI_TIMEZONE = 12;
	WIFI_State = WIFI_INITED;
}

static void SYSMENU_HANDL_WIFI_CAT_Server(int8_t direction)
{
	if (direction > 0)
		TRX.WIFI_CAT_SERVER = true;
	if (direction < 0)
		TRX.WIFI_CAT_SERVER = false;
}

static void SYSMENU_HANDL_WIFI_UpdateFW(int8_t direction)
{
#pragma unused(direction)
	LCD_systemMenuOpened = false;
	LCD_redraw(false);
	LCD_doEvents();
	WIFI_UpdateFW(NULL);
	LCD_showTooltip("Started, see console");
}

//SD MENU

static void SYSMENU_HANDL_SDMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = &sysmenu_sd_handlers[0];
	sysmenu_item_count_selected = &sysmenu_sd_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SD_ExportSettings(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		SD_doCommand(SDCOMM_EXPORT_SETTINGS, false);
	}
}

static void SYSMENU_HANDL_SD_ImportSettings(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		SD_doCommand(SDCOMM_IMPORT_SETTINGS, false);
	}
}

static void SYSMENU_HANDL_SD_Format(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		SD_doCommand(SDCOMM_FORMAT, false);
	}
}

//SET TIME MENU

static void SYSMENU_HANDL_SETTIME(int8_t direction)
{
	if (!sysmenu_timeMenuOpened)
		LCDDriver_Fill(BG_COLOR);
	sysmenu_timeMenuOpened = true;
	static uint8_t Hours;
	static uint8_t Minutes;
	static uint8_t Seconds;
	static uint32_t Time;
	char ctmp[50];
	Time = RTC->TR;
	Hours = ((Time >> 20) & 0x03) * 10 + ((Time >> 16) & 0x0f);
	Minutes = ((Time >> 12) & 0x07) * 10 + ((Time >> 8) & 0x0f);
	Seconds = ((Time >> 4) & 0x07) * 10 + ((Time >> 0) & 0x0f);
	if (direction != 0)
	{
		if (TimeMenuSelection == 0)
		{
			if (Hours == 0 && direction < 0)
				return;
			Hours = (uint8_t)(Hours + direction);
		}
		if (TimeMenuSelection == 1)
		{
			if (Minutes == 0 && direction < 0)
				return;
			Minutes = (uint8_t)(Minutes + direction);
		}
		if (TimeMenuSelection == 2)
		{
			if (Seconds == 0 && direction < 0)
				return;
			Seconds = (uint8_t)(Seconds + direction);
		}
		if (Hours >= 24)
			Hours = 0;
		if (Minutes >= 60)
			Minutes = 0;
		if (Seconds >= 60)
			Seconds = 0;
		RTC_TimeTypeDef sTime;
		sTime.TimeFormat = RTC_HOURFORMAT12_PM;
		sTime.SubSeconds = 0;
		sTime.SecondFraction = 0;
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sTime.StoreOperation = RTC_STOREOPERATION_SET;
		sTime.Hours = Hours;
		sTime.Minutes = Minutes;
		sTime.Seconds = Seconds;
		BKPSRAM_Enable();
		HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	}
	sprintf(ctmp, "%d", Hours);
	addSymbols(ctmp, ctmp, 2, "0", false);
	LCDDriver_printText(ctmp, 76, 100, COLOR->BUTTON_TEXT, TimeMenuSelection == 0 ? FG_COLOR : BG_COLOR, 3);
	LCDDriver_printText(":", 124, 100, COLOR->BUTTON_TEXT, BG_COLOR, 3);
	sprintf(ctmp, "%d", Minutes);
	addSymbols(ctmp, ctmp, 2, "0", false);
	LCDDriver_printText(ctmp, 148, 100, COLOR->BUTTON_TEXT, TimeMenuSelection == 1 ? FG_COLOR : BG_COLOR, 3);
	LCDDriver_printText(":", 194, 100, COLOR->BUTTON_TEXT, BG_COLOR, 3);
	sprintf(ctmp, "%d", Seconds);
	addSymbols(ctmp, ctmp, 2, "0", false);
	LCDDriver_printText(ctmp, 220, 100, COLOR->BUTTON_TEXT, TimeMenuSelection == 2 ? FG_COLOR : BG_COLOR, 3);
}

