witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
//FLASH MENU

static void SYSMENU_HANDL_Bootloader(int8_t direction)
{
#pragma unused(direction)
	WM8731_CleanBuffer();
	TRX_NeedGoToBootloader = true;
	TRX_Inited = false;
	LCD_busy = true;
}

//SYSTEM INFO
static void SYSMENU_HANDL_SYSINFO(int8_t direction)
{
	sysmenu_infowindow_opened = true;
	sysmenu_sysinfo_opened = true;
	if (direction != 0)
		LCDDriver_Fill(BG_COLOR);
#define y_offs 20
	uint16_t y = 10;
	char out[80];
	sprintf(out, "STM32 FW ver: %s", version_string);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "FPGA FW ver: %d.%d.%d", FPGA_FW_Version[2], FPGA_FW_Version[1], FPGA_FW_Version[0]);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "WIFI IP: %s", WIFI_IP);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "FPGA SAMPLES: %d     ", dbg_FPGA_samples);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "STM32 VOLTAGE: %f     ", TRX_STM32_VREF);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "IQ PHASE: %f     ", TRX_IQ_phase_error);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "ADC MIN/MAX: %d/%d     ", TRX_ADC_MINAMPLITUDE, TRX_ADC_MAXAMPLITUDE);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "VCXO ERROR: %d     ", TRX_VCXO_ERROR);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;

	LCD_UpdateQuery.SystemMenu = true;
}

//CALIBRATION MENU

static void SYSMENU_HANDL_CALIB_ENCODER_INVERT(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_INVERT = true;
	if (direction < 0)
		CALIBRATE.ENCODER_INVERT = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER2_INVERT(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER2_INVERT = true;
	if (direction < 0)
		CALIBRATE.ENCODER2_INVERT = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_DEBOUNCE(int8_t direction)
{
	if (CALIBRATE.ENCODER_DEBOUNCE > 0 || direction > 0)
		CALIBRATE.ENCODER_DEBOUNCE += direction;
	if (CALIBRATE.ENCODER_DEBOUNCE > 250)
		CALIBRATE.ENCODER_DEBOUNCE = 250;
}

static void SYSMENU_HANDL_CALIB_ENCODER2_DEBOUNCE(int8_t direction)
{
	if (CALIBRATE.ENCODER2_DEBOUNCE > 0 || direction > 0)
		CALIBRATE.ENCODER2_DEBOUNCE += direction;
	if (CALIBRATE.ENCODER2_DEBOUNCE > 250)
		CALIBRATE.ENCODER2_DEBOUNCE = 250;
}

static void SYSMENU_HANDL_CALIB_ENCODER_SLOW_RATE(int8_t direction)
{
	CALIBRATE.ENCODER_SLOW_RATE += direction;
	if (CALIBRATE.ENCODER_SLOW_RATE < 1)
		CALIBRATE.ENCODER_SLOW_RATE = 1;
	if (CALIBRATE.ENCODER_SLOW_RATE > 100)
		CALIBRATE.ENCODER_SLOW_RATE = 100;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ON_FALLING(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_ON_FALLING = true;
	if (direction < 0)
		CALIBRATE.ENCODER_ON_FALLING = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ACCELERATION(int8_t direction)
{
	CALIBRATE.ENCODER_ACCELERATION += direction;
	if (CALIBRATE.ENCODER_ACCELERATION < 1)
		CALIBRATE.ENCODER_ACCELERATION = 1;
	if (CALIBRATE.ENCODER_ACCELERATION > 250)
		CALIBRATE.ENCODER_ACCELERATION = 250;
}

static void SYSMENU_HANDL_CALIBRATIONMENU(int8_t direction)
{
#pragma unused(direction)
	if (!SYSMENU_hiddenmenu_enabled)
		return;
	sysmenu_handlers_selected = &sysmenu_calibration_handlers[0];
	sysmenu_item_count_selected = &sysmenu_calibration_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SWR_Tandem_Ctrl(int8_t direction) //Tisho
{
#pragma unused(direction)
	if (SYSMENU_TDM_CTRL_opened)
	{
	}
	else
	{
		SYSMENU_TDM_CTRL_opened = true;
		TDM_Voltages_Start();
		//		drawSystemMenu(true);
	}
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2200M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2200m > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m > 100)
		CALIBRATE.rf_out_power_2200m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_160M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_160m > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m == 0 && direction > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m > 100)
		CALIBRATE.rf_out_power_160m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_80M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_80m > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m == 0 && direction > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m > 100)
		CALIBRATE.rf_out_power_80m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_40M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_40m > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m == 0 && direction > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m > 100)
		CALIBRATE.rf_out_power_40m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_30M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_30m > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m == 0 && direction > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m > 100)
		CALIBRATE.rf_out_power_30m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_20M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_20m > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m == 0 && direction > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m > 100)
		CALIBRATE.rf_out_power_20m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_17M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_17m > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m == 0 && direction > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m > 100)
		CALIBRATE.rf_out_power_17m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_15M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_15m > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m == 0 && direction > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m > 100)
		CALIBRATE.rf_out_power_15m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_12M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_12m > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m == 0 && direction > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m > 100)
		CALIBRATE.rf_out_power_12m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_10M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_10m > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m == 0 && direction > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m > 100)
		CALIBRATE.rf_out_power_10m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

