witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_FW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.FW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.FW_AD8307_OFFS < 0.1f)
		CALIBRATE.FW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.FW_AD8307_OFFS > 4000.0f)
		CALIBRATE.FW_AD8307_OFFS = 4000.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.BW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.BW_AD8307_SLP < 20.0f)
		CALIBRATE.BW_AD8307_SLP = 20.0f;
	if (CALIBRATE.BW_AD8307_SLP > 30.0f)
		CALIBRATE.BW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.BW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.BW_AD8307_OFFS < 0.1f)
		CALIBRATE.BW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.BW_AD8307_OFFS > 4000.0f)
		CALIBRATE.BW_AD8307_OFFS = 4000.0f;
}
//end Tisho

//SERVICES
void SYSMENU_HANDL_SERVICESMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_services_opened = true;
	sysmenu_handlers_selected = &sysmenu_services_handlers[0];
	sysmenu_item_count_selected = &sysmenu_services_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	//drawSystemMenu(true);
	LCD_redraw(false);
}

//SPECTRUM ANALIZER
static void SYSMENU_HANDL_SPECTRUMMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = &sysmenu_spectrum_handlers[0];
	sysmenu_item_count_selected = &sysmenu_spectrum_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SPECTRUM_Start(int8_t direction)
{
	if (SYSMENU_spectrum_opened)
	{
		SPEC_EncRotate(direction);
	}
	else
	{
		SYSMENU_spectrum_opened = true;
		SPEC_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_SPECTRUM_Begin(int8_t direction)
{
	TRX.SPEC_Begin += direction * 100;
	if (TRX.SPEC_Begin < 100)
		TRX.SPEC_Begin = 100;
}

static void SYSMENU_HANDL_SPECTRUM_End(int8_t direction)
{
	TRX.SPEC_End += direction * 100;
	if (TRX.SPEC_End < 100)
		TRX.SPEC_End = 100;
}

static void SYSMENU_HANDL_SPECTRUM_TopDBM(int8_t direction)
{
	TRX.SPEC_TopDBM += direction;
	if (TRX.SPEC_TopDBM < -140)
		TRX.SPEC_TopDBM = -140;
	if (TRX.SPEC_TopDBM > 40)
		TRX.SPEC_TopDBM = 40;
	if (TRX.SPEC_TopDBM <= TRX.SPEC_BottomDBM)
		TRX.SPEC_TopDBM = TRX.SPEC_BottomDBM + 1;
}

static void SYSMENU_HANDL_SPECTRUM_BottomDBM(int8_t direction)
{
	TRX.SPEC_BottomDBM += direction;
	if (TRX.SPEC_BottomDBM < -140)
		TRX.SPEC_BottomDBM = -140;
	if (TRX.SPEC_BottomDBM > 40)
		TRX.SPEC_BottomDBM = 40;
	if (TRX.SPEC_BottomDBM >= TRX.SPEC_TopDBM)
		TRX.SPEC_BottomDBM = TRX.SPEC_TopDBM - 1;
}

//WSPR Beacon
static void SYSMENU_HANDL_WSPRMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = &sysmenu_wspr_handlers[0];
	sysmenu_item_count_selected = &sysmenu_wspr_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_WSPR_Start(int8_t direction)
{
	if (SYSMENU_wspr_opened)
	{
		WSPR_EncRotate(direction);
	}
	else
	{
		SYSMENU_wspr_opened = true;
		WSPR_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_WSPR_FREQ_OFFSET(int8_t direction)
{
	TRX.WSPR_FREQ_OFFSET += direction;
	if (TRX.WSPR_FREQ_OFFSET < -2000)
		TRX.WSPR_FREQ_OFFSET = -2000;
	if (TRX.WSPR_FREQ_OFFSET > 2000)
		TRX.WSPR_FREQ_OFFSET = 2000;
}

static void SYSMENU_HANDL_WSPR_BAND160(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_160 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_160 = false;
}

static void SYSMENU_HANDL_WSPR_BAND80(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_80 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_80 = false;
}

static void SYSMENU_HANDL_WSPR_BAND40(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_40 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_40 = false;
}

static void SYSMENU_HANDL_WSPR_BAND30(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_30 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_30 = false;
}

static void SYSMENU_HANDL_WSPR_BAND20(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_20 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_20 = false;
}

static void SYSMENU_HANDL_WSPR_BAND17(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_17 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_17 = false;
}

static void SYSMENU_HANDL_WSPR_BAND15(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_15 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_15 = false;
}

static void SYSMENU_HANDL_WSPR_BAND12(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_12 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_12 = false;
}

static void SYSMENU_HANDL_WSPR_BAND10(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_10 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_10 = false;
}

static void SYSMENU_HANDL_WSPR_BAND6(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_6 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_6 = false;
}

static void SYSMENU_HANDL_WSPR_BAND2(int8_t direction)
{
	if (direction > 0)
		TRX.WSPR_BANDS_2 = true;
	if (direction < 0)
		TRX.WSPR_BANDS_2 = false;
}

//SWR BAND ANALYZER
static void SYSMENU_HANDL_SWR_BAND_START(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
		SWR_Start(BANDS[band].startFreq - 100000, BANDS[band].endFreq + 100000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

//SWR HF ANALYZER
static void SYSMENU_HANDL_SWR_HF_START(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		SWR_Start(1000000, 60000000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

//RDA STATS
static void SYSMENU_HANDL_RDA_STATS(int8_t direction)
{
#pragma unused(direction)
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getRDA();
}

//PROPAGINATION
static void SYSMENU_HANDL_PROPAGINATION(int8_t direction)
{
#pragma unused(direction)
	sysmenu_infowindow_opened = true;
	SYSMENU_drawSystemMenu(true);
	WIFI_getPropagination();
}

//COMMON MENU FUNCTIONS
void SYSMENU_drawSystemMenu(bool draw_background)
{
	if (LCD_busy)
	{
		LCD_UpdateQuery.SystemMenu = true;
		if (draw_background)
			LCD_UpdateQuery.SystemMenuRedraw = true;
		return;
	}
	if (!LCD_systemMenuOpened)
		return;
	if (sysmenu_timeMenuOpened)
	{
		SYSMENU_HANDL_SETTIME(0);
	}
	else if (sysmenu_wifi_selectap1_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP1Menu(0);
		return;
	}
	else if (sysmenu_wifi_selectap2_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP2Menu(0);
		return;
	}
	else if (sysmenu_wifi_selectap3_menu_opened)
	{
		SYSMENU_WIFI_DrawSelectAP3Menu(0);
		return;
	}
	else if (sysmenu_wifi_setAP1password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP1passwordMenu(draw_background);
	}
	else if (sysmenu_wifi_setAP2password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP2passwordMenu(draw_background);
	}
	else if (sysmenu_wifi_setAP3password_menu_opened)
	{
		SYSMENU_WIFI_DrawAP3passwordMenu(draw_background);
	}
	else if (sysmenu_trx_setCallsign_menu_opened)
	{
		SYSMENU_TRX_DrawCallsignMenu(draw_background);
	}
	else if (sysmenu_trx_setLocator_menu_opened)
	{
		SYSMENU_TRX_DrawLocatorMenu(draw_background);
	}
	else if (SYSMENU_spectrum_opened)
	{
		SPEC_Draw();
	}
	else if (SYSMENU_wspr_opened)
	{
		WSPR_DoEvents();
	}
	else if (SYSMENU_TDM_CTRL_opened) //Tisho
	{
		TDM_Voltages();
	}
	else if (SYSMENU_swr_opened)
	{
		SWR_Draw();
	}
	else if (sysmenu_sysinfo_opened)
	{
		SYSMENU_HANDL_SYSINFO(0);
		return;
	}
	else if (sysmenu_infowindow_opened)
	{
	}
	else
	{
		LCD_busy = true;

		sysmenu_i = 0;
		sysmenu_y = 5;

		if (draw_background)
			LCDDriver_Fill(BG_COLOR);

		uint8_t current_selected_page = systemMenuIndex / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
		if (current_selected_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE > *sysmenu_item_count_selected)
			current_selected_page = 0;

		for (uint8_t m = 0; m < *sysmenu_item_count_selected; m++)
		{
			uint8_t current_page = m / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
			if (current_selected_page == current_page)
				drawSystemMenuElement(sysmenu_handlers_selected[m].title, sysmenu_handlers_selected[m].type, sysmenu_handlers_selected[m].value, false);
		}

		LCD_busy = false;
	}

	LCD_UpdateQuery.SystemMenu = false;
	if (draw_background)
		LCD_UpdateQuery.SystemMenuRedraw = false;
}

