witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_redrawCurrentItem(void)
{
	uint8_t current_page = systemMenuIndex / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
	sysmenu_i = (uint8_t)(systemMenuIndex - current_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE);
	sysmenu_y = 5 + (systemMenuIndex - current_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE) * LAYOUT->SYSMENU_ITEM_HEIGHT;
	drawSystemMenuElement(sysmenu_handlers_selected[systemMenuIndex].title, sysmenu_handlers_selected[systemMenuIndex].type, sysmenu_handlers_selected[systemMenuIndex].value, true);
}

static void drawSystemMenuElement(char *title, SystemMenuType type, uint32_t *value, bool onlyVal)
{
	if (!SYSMENU_hiddenmenu_enabled && type == SYSMENU_HIDDEN_MENU)
		return;

	char ctmp[10] = {0};
	if (!onlyVal)
	{
		LCDDriver_Fill_RectXY(0, sysmenu_y, LAYOUT->SYSMENU_W, sysmenu_y + 17, BG_COLOR);
		LCDDriver_printText(title, LAYOUT->SYSMENU_X1, sysmenu_y, FG_COLOR, BG_COLOR, 2);
	}

	uint16_t x_pos = LAYOUT->SYSMENU_X2;
	float32_t tmp_float = 0;
	switch (type)
	{
	case SYSMENU_UINT8:
		sprintf(ctmp, "%d", (uint8_t)*value);
		break;
	case SYSMENU_UINT16:
		sprintf(ctmp, "%d", (uint16_t)*value);
		break;
	case SYSMENU_UINT32:
		sprintf(ctmp, "%u", (uint32_t)*value);
		x_pos = LAYOUT->SYSMENU_X2_BIGINT;
		break;
	case SYSMENU_UINT32R:
		sprintf(ctmp, "%u", (uint32_t)*value);
		x_pos = LAYOUT->SYSMENU_X2R_BIGINT; //-V1048
		break;
	case SYSMENU_INT8:
		sprintf(ctmp, "%d", (int8_t)*value);
		break;
	case SYSMENU_INT16:
		sprintf(ctmp, "%d", (int16_t)*value);
		break;
	case SYSMENU_INT32:
		sprintf(ctmp, "%d", (int32_t)*value);
		x_pos = LAYOUT->SYSMENU_X2_BIGINT;
		break;
	case SYSMENU_FLOAT32:
		memcpy(&tmp_float, value, sizeof(float32_t));
		sprintf(ctmp, "%.2f", (double)tmp_float);
		x_pos = LAYOUT->SYSMENU_X2_BIGINT;
		break;
	case SYSMENU_BOOLEAN:
		sprintf(ctmp, "%d", (int8_t)*value);
		if ((uint8_t)*value == 1)
			sprintf(ctmp, "YES");
		else
			sprintf(ctmp, "NO");
		break;
	case SYSMENU_RUN:
		sprintf(ctmp, "RUN");
		break;
	case SYSMENU_MENU:
		sprintf(ctmp, "->");
		break;
	case SYSMENU_HIDDEN_MENU:
		sprintf(ctmp, "!!!");
		break;
	case SYSMENU_INFOLINE:
		break;
	case SYSMENU_FUNCBUTTON:
		sprintf(ctmp, "%s    ", (char *)PERIPH_FrontPanel_FuncButtonsList[TRX.FuncButtons[(uint8_t)*value]].name);
		break;
	}

	if (onlyVal)
		LCDDriver_Fill_RectWH(x_pos, sysmenu_y, 6 * 12, 13, BG_COLOR);
	if (type != SYSMENU_INFOLINE)
		LCDDriver_printText(ctmp, x_pos, sysmenu_y, FG_COLOR, BG_COLOR, 2);

	uint8_t current_selected_page = systemMenuIndex / LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE;
	if (systemMenuIndex == sysmenu_i + current_selected_page * LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE)
	{
		if (sysmenu_item_selected_by_enc2)
			LCDDriver_drawFastHLine(0, sysmenu_y + 17, LAYOUT->SYSMENU_W, COLOR->BUTTON_TEXT);
		else
			LCDDriver_drawFastHLine(0, sysmenu_y + 17, LAYOUT->SYSMENU_W, FG_COLOR);
	}
	sysmenu_i++;
	sysmenu_y += LAYOUT->SYSMENU_ITEM_HEIGHT;
}
